In [1]:
print("sapna")

sapna

In [3]:
import pandas as pd
data1={"emp_id":["emp1","emp2","emp3","emp4","emp5","emp6","emp7","emp8","emp9","emp10"],
       "name":["vikash","sapna","ram","shyam","sita","reeta","krishna","raghav","hanuman","harsita"],
       "age":[20,22,34,45,23,30,31,25,29,28]}
data2={"emp_id":["emp1","emp2","emp13","emp4","emp24","emp6","emp7","emp18","emp9","emp10"],
       "sallary":[50000,80000,90000,50000,40000,50000,60000,70000,40000,70000]}
df1=pd.DataFrame(data1)
df2=pd.DataFrame(data2)
print(df1)
print(df2)

  emp_id     name  age
0   emp1   vikash   20
1   emp2    sapna   22
2   emp3      ram   34
3   emp4    shyam   45
4   emp5     sita   23
5   emp6    reeta   30
6   emp7  krishna   31
7   emp8   raghav   25
8   emp9  hanuman   29
9  emp10  harsita   28
  emp_id  sallary
0   emp1    50000
1   emp2    80000
2  emp13    90000
3   emp4    50000
4  emp24    40000
5   emp6    50000
6   emp7    60000
7  emp18    70000
8   emp9    40000
9  emp10    70000

In [4]:
data1={"emp_id":["emp1","emp2","emp3","emp4","emp5","emp6","emp7","emp8","emp9","emp10"],
       "name":["vikash","sapna","ram","shyam","sita","reeta","krishna","raghav","hanuman","harsita"],
       "age":[20,22,34,45,23,30,31,25,29,28]}
data2={"emp_id":["emp1","emp2","emp13","emp4","emp24","emp6","emp7","emp18","emp9","emp10"],
       "sallary":[50000,80000,90000,50000,40000,50000,60000,70000,40000,70000]}
df1=pd.DataFrame(data1)
df2=pd.DataFrame(data2)
print(df1)
print()     #space between df1 and df2.
print(df2)

  emp_id     name  age
0   emp1   vikash   20
1   emp2    sapna   22
2   emp3      ram   34
3   emp4    shyam   45
4   emp5     sita   23
5   emp6    reeta   30
6   emp7  krishna   31
7   emp8   raghav   25
8   emp9  hanuman   29
9  emp10  harsita   28

  emp_id  sallary
0   emp1    50000
1   emp2    80000
2  emp13    90000
3   emp4    50000
4  emp24    40000
5   emp6    50000
6   emp7    60000
7  emp18    70000
8   emp9    40000
9  emp10    70000

In [5]:
print(pd.merge(df1,df2,on="emp_id"))

  emp_id     name  age  sallary
0   emp1   vikash   20    50000
1   emp2    sapna   22    80000
2   emp4    shyam   45    50000
3   emp6    reeta   30    50000
4   emp7  krishna   31    60000
5   emp9  hanuman   29    40000
6  emp10  harsita   28    70000

In [6]:
print(pd.merge(left=df1,right=df2,on="emp_id",how="left"))

  emp_id     name  age  sallary
0   emp1   vikash   20  50000.0
1   emp2    sapna   22  80000.0
2   emp3      ram   34      NaN
3   emp4    shyam   45  50000.0
4   emp5     sita   23      NaN
5   emp6    reeta   30  50000.0
6   emp7  krishna   31  60000.0
7   emp8   raghav   25      NaN
8   emp9  hanuman   29  40000.0
9  emp10  harsita   28  70000.0

In [7]:
print(pd.merge(left=df1,right=df2,on="emp_id",how="right"))

  emp_id     name   age  sallary
0   emp1   vikash  20.0    50000
1   emp2    sapna  22.0    80000
2  emp13      NaN   NaN    90000
3   emp4    shyam  45.0    50000
4  emp24      NaN   NaN    40000
5   emp6    reeta  30.0    50000
6   emp7  krishna  31.0    60000
7  emp18      NaN   NaN    70000
8   emp9  hanuman  29.0    40000
9  emp10  harsita  28.0    70000

In [25]:
# print(df1.join(df1,df2,on="emp_id"))

df1_indexed = df1.set_index("emp_id")
df2_indexed = df2.set_index("emp_id")

result = df1_indexed.join(df2_indexed, how="inner")
print(result)

           name  age  sallary
emp_id
emp1     vikash   20    50000
emp2      sapna   22    80000
emp4      shyam   45    50000
emp6      reeta   30    50000
emp7    krishna   31    60000
emp9    hanuman   29    40000
emp10   harsita   28    70000

In [21]:
data1={"emp_id":["emp1","emp2","emp3","emp4","emp5","emp6","emp7","emp8","emp9","emp10"],
       "name":["vikash","sapna","ram","shyam","sita","reeta","krishna","raghav","hanuman","harsita"],
       "age":[20,22,34,45,23,30,31,25,29,28]}
data2={"emp_id":["emp11","emp12","emp13","emp14","emp15","emp16","emp17","emp18","emp19","emp20"],
       "name":["sap","rap","tap","lap","hap","jap","yap","kap","dap","fap"],
       "age":[23,45,34,31,34,35,41,41,15,33]}
df1=pd.DataFrame(data1)
df2=pd.DataFrame(data2)
print(df1)
print(df2)

  emp_id     name  age
0   emp1   vikash   20
1   emp2    sapna   22
2   emp3      ram   34
3   emp4    shyam   45
4   emp5     sita   23
5   emp6    reeta   30
6   emp7  krishna   31
7   emp8   raghav   25
8   emp9  hanuman   29
9  emp10  harsita   28
  emp_id name  age
0  emp11  sap   23
1  emp12  rap   45
2  emp13  tap   34
3  emp14  lap   31
4  emp15  hap   34
5  emp16  jap   35
6  emp17  yap   41
7  emp18  kap   41
8  emp19  dap   15
9  emp20  fap   33

In [ ]:
print(pd.concat([